Revit 2026 API

# InstanceBinding(CategorySet) Constructor

---

Constructs an instance binding with the set of categories passed.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public InstanceBinding(
	CategorySet categories
)
```
```vb
Public Sub New (
	categories As CategorySet
)
```
```cpp
public:
InstanceBinding(
	CategorySet^ categories
)
```
```fsharp
new :
        categories : CategorySet -> InstanceBinding
```

#### Parameters

categories CategorySet

Categories can be set or changed at a later time by using the Categories property of this object.

#### Reference

InstanceBinding Class

InstanceBinding Overload

Autodesk.Revit.DB Namespace